#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <Windows.h>

typedef struct _Status { int INT; int STR; int ART; int STRESS; } Status;

Status status = { 0, 0, 0, 0 };

int day = 1;
int chance;		//확률
int choice;       //입력받은 수 받아줄 변수
//전역변수 설정

void printStatus(Status status) {
	printf(" ____________________________________________\n");
	printf("|               수뭉이의 스탯                |\n");
	printf("|  지능 : %3d  운동능력 : %3d  예술성 : %3d  |\n", status.INT, status.STR, status.ART);
	printf("|  스트레스 : %3d                            |\n", status.STRESS);
	printf("|____________________________________________|\n");
}

void printFinalStatus(Status status) {
	printf(" ____________________________________________\n");
	printf("|                  최종 스탯                 |\n");
	printf("|  지능 : %3d  운동능력 : %3d  예술성 : %3d  |\n", status.INT, status.STR, status.ART);
	printf("|  스트레스 : %3d                            |\n", status.STRESS);
	printf("|____________________________________________|\n");
}

void childSuMoong() {
	printf("\033[33m");
	printf("                           @@@  @@             @@  #@@@@@@                      \n"); //어린 수뭉이
	printf("                         @@       ,@@         @   @@@@    @                     \n");
	printf("                       @@       @    @       @@  @@  *@  @@                     \n");
	printf("                       @@@@@@   @.@@@        @@  *@@@@@  @                      \n");
	printf("                            @   @@@@@,          @@  @@@@@                       \n");
	printf("                       ,@@           @@     @@@@@   @@%%                         \n");
	printf("                       @@@@@@    @@@@       @@@@%%      @#                       \n");
	printf("                            @@   @@@@@@@@@@@@@ @@@@                             \n");
	printf("                           &@@@@                (@@@@@                          \n");
	printf("                       ,@@@                           *@@@                      \n");
	printf("                   #@@@*         @@@     @@*              @@@                   \n");
	printf("           @@@@@@@@@@           @  @@@@@@@@@@                @@ @@@@@@@@        \n");
	printf("           @@    @@          /@    @(@  @@   @%%                @@     @@        \n");
	printf("             @@@@@              @@@@@@@@@@@@@@@@@@@             @@@ @@@         \n");
	printf("             @@@@       @@@@@@@@                    &@@@@@@      @@@@           \n");
	printf("         @@@  @@   @@@@@.                                   @@@   @@            \n");
	printf("     @@@      @@@@                                              @@ @@           \n");
	printf("    @        @@                  @@@@@        @@@@@               @@@           \n");
	printf("    @@    @@@@@      ...,*,,,,.  @@@@@, /  @  @@@@@&               @@(          \n");
	printf("            @@    ,**************,.   &  @@      *************,     @@          \n");
	printf("           ,@     ,*****@@@@@@@**..    @@   @   ***************.     @@         \n");
	printf("           @@         @         @        @@@      .,,,,****,.        @@         \n");
	printf("           (@#       @@@@@@@@/*@@@                           ,       @@         \n");
	printf("            @@        @         @                        @@@,@@@@   @@          \n");
	printf("             @@@        @@.  @@                         @@@@ @ @@@@@@           \n");
	printf("              *@@        *@@                            @@       @@@            \n");
	printf("                /@@      @/@                           @@@@@@(  ,@@             \n");
	printf("                   @@@@( @ @                          ,@         @.             \n");
	printf("                  @@    @@@@@@@*                      @         @@              \n");
	printf("                  @      @ .@@@  @@@@@@@@%%@@@@@@@@@@@@@@       @@               \n");
	printf("                  @     %%@  &@   @@@,           @       @@@ @@@                 \n");
	printf("                  &@     @ @@                            @@                     \n");
	printf("                      @@@@@     @@                       @@                     \n");
	printf("                      @@        @  *@@@@@@@@@@@@@@       @@                     \n");
	printf("                      @@        @               @        @@                     \n");
	printf("                      @@        @@@@@@@@@@@@@@@@@        @@                     \n");
	printf("                      @@@,            @@@@%%, .           @@                     \n");
	printf("                        @@  &@@@@@@@@@       @@@@@@@@@@@@@@.                    \n");
	printf("                       @@@@/      @@@         @@         @                      \n");
	printf("\033[0m");
	Sleep(3000);
}

void proEnd() {
	printf("수뭉이가 제출한 논문이 통과되어 교수가 되었습니다.");
	printf("\033[33m");
	printf("                               @@ @@@          @@    @@@.                       \n");
	printf("                             @@      @@        @  @@@@ @@                       \n");
	printf("                             @.@@/ @@@@       /@  @@@@ @                        \n");
	printf("                              @@@@  @, @#     .@&@  @@@/                        \n");
	printf("                             (@@@@  @@@%%     @@@#    ,@@                        \n");
	printf("                                @@@@@@@&@@@@@@@@@@*@@@@                         \n");
	printf("                           (@@.                      @@@@                       \n");
	printf("                        @@.                               @@#                   \n");
	printf("                     @@                                      @@@                \n");
	printf("                  (@                                            @@              \n");
	printf("          @@@@@@@@#                                                @@@@@@@      \n");
	printf("         @@    @@                                                        @@     \n");
	printf("          @@  @@                                               #@       @@      \n");
	printf("             @@@@@       @@@@@@@@@@       @@@@@@@@@@        @@@  @@@@@@         \n");
	printf("             @     &@@ @@          @@/@@@@          (@ &@@@           @@        \n");
	printf("            @@        @@     @@@@@# @@  @  @@@@@     @@                @        \n");
	printf("            @@        .@     @@@@@  @&  @  @@@@@     @@                @        \n");
	printf("            @      ,((((@%%((((((.  @,@@@ @@       ,(@@(((((((((*       @#       \n");
	printf("           @*    ./(((((((@@@@@@@@   @@@   /@@@@@@@(((((((((((((        @       \n");
	printf("          &@        ,//////,      @@@@  @@@       ,/((((((((*.          @@      \n");
	printf("          %%@                        @@.@,                               @@      \n");
	printf("           @@                                                           @       \n");
	printf("             @@      @@@@&@@@@        /@@@@@@@@@                       @        \n");
	printf("               @@@ @@           ,@@              @@                  @@         \n");
	printf("                   @@            ,@                @              @@@           \n");
	printf("                    @             @               @@@@@    ,@@@@                \n");
	printf("                  @@@@@@          @@            @@    *@     @@                 \n");
	printf("                 @ @@   @         #@            @      @     @@                 \n");
	printf("                 @@@@ @@#          @             @@@@ @@ @@@/@@                 \n");
	printf("                     @@@@@@%%  *@@@@@@@@/////   @@@@@@        @@                 \n");
	printf("                       @             @@ @@         &@@@@@@@@ %%@@@@&             \n");
	printf("                       @@@@@@@@@@@@@@@@@@@@#@@@@@@@@@@@@@@@@@ @  @#             \n");
	printf("                       @@                                     @%%                \n");
	printf("                        @.       @@@@@@@@@@@@@@ @@@          @@                 \n");
	printf("                        #@@@@@@@@@@@@             @@@@@@@@@@ @.                 \n");
	printf("                        @@        @@              @       %%@@                   \n");
	printf("\033[0m");
	Sleep(3000);
	printf("\nThe End");
}

void artEnd() {
	printf("수뭉이의 작품이 유명해져 뭉화백이 되었습니다.");
	printf("\033[33m");
	printf("                       @@@@               @@@@@@@,                              \n");
	printf("                     @@    ,@@           @          @(                          \n");
	printf("                  @@          @@        @@  @@ @@@  @@                          \n");
	printf("                 @@   @@   @@  .@       @   @@@/@@  @                           \n");
	printf("                  @@@*&@   @            @@@@       @@                           \n");
	printf("                    @@@@   @@@@@@@      &. @   @                                \n");
	printf("                  @@            @@    @         /@@                             \n");
	printf("                   @@@@@@    @ /@@@@@@@@@@@@@@@@@@@                             \n");
	printf("                  @@@  @@ @@@%%                       @@                         \n");
	printf("                  @@,@@@@                            @@                         \n");
	printf("                  @@@                               @@                          \n");
	printf("           (@@@@@@                                @@@@@@@@@@@@@@                \n");
	printf("       @@   @@                               ,@@@@@@@@@@@@      @@              \n");
	printf("       @( @@                            &@@@    @@@@@@@@@@@,@@@ @@              \n");
	printf("        @&                         @@@           @@@@@@@@@@@@ @@                \n");
	printf("      @@                      @@@                 *@@@@@@@@@@@@                 \n");
	printf("     @                   @@@                       @@@@@@@@@@@@@                \n");
	printf("    @              @@@@                             @@@@@@@@@@@@                \n");
	printf("    @@/     #@@@@           @@@@@        @@@@@       @@@@@@@@@@@@               \n");
	printf("       @@@@@                @@@@@  @@@@  @@@@@       &@@@@@@@@@@@         @@@@& \n");
	printf("      @@@@@@      ((((((,       @@@@@@@@@             @@@@@@@@@@@@      @@@@@@@ \n");
	printf("      @@@@@@  ((((((((((((((((    @@  @    (((((((((((@@@@@@@@@@@@@    @     @  \n");
	printf("      @@@@@@     ,((((((((((                ((((((((((@@@@@@@@@@@@@@   @@@@@@   \n");
	printf("     @@@@@@@                                         @@@@@@@@@@@ @   @@ @@      \n");
	printf("    @@@@@@@@@          @@@ @@@@@@,                              @   @& @.       \n");
	printf("  %%@@@@@@@@@@@ @@ &@* @@ &@@@@@@@@@@                           @   @ @@         \n");
	printf("          @,  @@@  @@ @@  .@       @#                        @@  @@ @@          \n");
	printf("            @@@            @@       @@                       @@@  @@@            \n");
	printf("              @@          @@ @    @@                   @@@@ @(  @@@              \n");
	printf("            @@  @ @ @@   @@@        @             @@@@     @@ @    @@           \n");
	printf("            @    @  @  @            @@@@%%*     @@           @@ @@@              \n");
	printf("            @    @ @@  @@    @@ .@@ @@@@@   @@%%              @@                 \n");
	printf("             @@@ @ @@ @@   &@@   @  &@                 %%@@@                     \n");
	printf("                @ @@          @@@    @                @@                        \n");
	printf("                @  #@@@@@@@@@@%%                       @@                        \n");
	printf("                 @@@@@                            @@@@                          \n");
	printf("                 @@@@@@@@@ @@@@@@@@@@@@@@@@@# @@    ,@                          \n");
	printf("                  @             @@@@@@@@            @@                          \n");
	printf("                  @@@@@@@@@@@@@@        @@@@@@@@@@@@@                           \n");
	printf("                   @@@&.. #@@@          @@(       ,@@                           \n");
	printf("\033[0m");
	Sleep(3000);
	printf("\nThe End");
}

void spoEnd() {
	printf("수뭉이가 열심히 운동을 한 결과, 세계적인 운동선수가 되었습니다.");
	printf("\033[33m");
	printf("                      @                @@#,,#/@@@                              \n");
	printf("                     @     @@&         @  @@@@@  @@                             \n");
	printf("                   @          @        @  @@  @  @@                             \n");
	printf("                  @    @  @@@@&        @@(       @                              \n");
	printf("                   @@@ @   @@@@@@     @@@@   @                                  \n");
	printf("                     @@#       @@    @@         @@                              \n");
	printf("                    @@  @&   @          @   %%@@@@                               \n");
	printf("                         @    @@@@@@@@@@@   @@@%%                                \n");
	printf("                         @@@@@*          @@#  @@@@@@                            \n");
	printf("                     .@&            @@@@@@@@@@@@@@@@@@   .*@@@                  \n");
	printf("                   @@ &@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @                  \n");
	printf("           @@@,  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*                   \n");
	printf("           @    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@%%        @&                   \n");
	printf("            @@ @@@@@@@@@@@@@@@@@@@@@@@@@                    @@                  \n");
	printf("             @@@@@@@@@@@@@/                                  @@                 \n");
	printf("            @@@             @@@@        /@@@@@                @*@@@@@@          \n");
	printf("          @@@@@                @@@    @ @@@@@@               @@@@@@@@@@@@       \n");
	printf("        @@@@@@               @@   @& @@@#      .(((((((    #@@@@@@@@@@@@@@      \n");
	printf("      @@@@@@@@     ((((((((((((.  @   %%@    (((((((((((((  @@@@@@@@@@@@@@@      \n");
	printf("    @@@@@@@@ @     (((((((((((,    @@@                      @@@@@@@@@@@@@@      \n");
	printf("    @@@@@@   @                                            @@  @@@@@@@@@@        \n");
	printf("      @@     /@                                          @      @               \n");
	printf("               @                                        @       @               \n");
	printf("                @@                                     @@@#    @@               \n");
	printf("                  @@@                                 @@@@@@@@@@                \n");
	printf("               @@      @@@@                     @@@@@ #@@@@@@@                  \n");
	printf("              @         @@ @@ @@@  @@. @@  @@  @@* @@# @@/@@                    \n");
	printf("               @@&     @@ @@  @@  .@@  @@  @@  @@@ /@@  @@@                     \n");
	printf("                      @@(@@@ @@@  @@   @@  @@   @@  @@  @@@                     \n");
	printf("                      @@@@@@@@@,  @@   @@  @@   @@@@@@@@& @                     \n");
	printf("                      @                                    @                    \n");
	printf("                     @@@@#                                .@                    \n");
	printf("                     @@/        *%%@@@@@@@@@@@@@@@@@@@/     @                    \n");
	printf("                      /@@@@@@@@@@@@            @@@@@@@@@@@@                     \n");
	printf("                                                  @@@@@@@                       \n");
	printf("\033[0m");
	Sleep(3000);
	printf("\nThe End");
}

void runEnd() {
	printf("수뭉이가 당신에게 말도 없이 떠났습니다. 너무 많은 스트레스를 준건 아닐까요?");
	printf("\nThe End");
}

void jobXEnd() {
	printf("열심히 구직활동을 했지만 아무도 수뭉이를 찾지않았습니다.");
	printf("\nThe End");
}

void tired()   //스트레스 높을때 나오는 함수
{
	printf("\033[31m");
	printf("수뭉이가 힘들어 보입니다.\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@                @@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@      @@@@@@@@@@@@@@      @@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@    .@@@@@@   @@@@@    @@@@@@     @@@@@@@@@@@@@\n");
	printf("@@@@@@@@@   @@@@@      @@@@@@@@@@        @@    @@@@@@@@@@@\n");
	printf("@@@@@@@   @@@@    @@@@@@@@@@@@@@@@@@@@@@.@@@@@   @@@@@@@@@\n");
	printf("@@@@@@   @@@@@     ,@@@@@@@@@@@@@@@@@@     @@@@@   @@@@@@@@\n");
	printf("@@@@@   @@@@@@@@@@       @@@@@@@@@       @@@@@@@@@   @@@@@@\n");
	printf("@@@@@  @@@@@@@@@@@@@@     @@@@@@     @@@@@@@@@@@@@@  @@@@@@\n");
	printf("@@@@@   @@@@@@@@@@@@     @@@@@@@@@      @@@@@@@@@@@@   @@@@@\n");
	printf("@@@@@  @@@@@@@@@@    (@@@@@@@@@@@@@@@@    @@@@@@@@@@   @@@@@\n");
	printf("@@@@@  @@@@@@@@@@@@@@@@@%%           @@@@@@@@@@@@@@@@   @@@@@\n");
	printf("@@@@@   @@@@@@@@@@@@                   @@@@@@@@@@@@@   @@@@@\n");
	printf("@@@@@%%  @@@@@@@@@                         @@@@@@@@@@  @@@@@@\n");
	printf("@@@@@@   @@@@@@@                           @@@@@@@@   @@@@@@\n");
	printf("@@@@@@@   @@@@@                             @@@@@   /@@@@@@@\n");
	printf("@@@@@@@@@   @@@        #@@@@@@@@@@@@@@.     @@@@   @@@@@@@@@\n");
	printf("@@@@@@@@@@@   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@*    @@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@      @@@@@@@@@@@@@@@(     .@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@                 (@@@@@@@@@@@@@@@@@@@@@\n");
	printf("\033[0m");
	return;
}

void contest() //학술제 이벤트
{
	printf("오늘은 학술제가 있는 날입니다. 어떤 대회에 참가하시겠습니까?\n");
	printf("1. 수학 올림피아드\n");
	printf("2. 전국 체전\n");
	printf("3. 그림 공모전\n");
	printf("어떤 대회에 참가할지 숫자로 적어주세요(1 ~ 3 이외의 숫자 입력 시 랜덤 선택) : ");
	scanf("%d", &choice);
	if (choice > 3 || choice < 1)  //1~3 외의 숫자 입력시 1~3사이에서 랜덤 선택
	{
		srand(time(NULL));
		choice = (rand() % 3) + 1;
	}
	Sleep(1000);
	switch (choice) //입력받은 숫자에 따라 행동
	{
	case 1:
		printf("수뭉이가 수학 올림피아드에 나갔습니다. 좋은 결과를 기대합니다.\n");
		Sleep(1000);
		srand(time(NULL));
		chance = (rand() % 50) + 1;
		if (status.INT > chance) //지능이 높을수록 입상할 확률 높음
		{
			printf("수뭉이가 올림피아드에서 입상했습니다!\n");
			printf("지능 +10\n"); //입상시 스텟업
			status.INT += 10;
		}
		else
		{
			printf("수뭉이가 아쉽게도 입상하지 못했습니다.\n");
		}
		break;

	case 2:
		printf("수뭉이가 전국 체전에 나갔습니다. 좋은 결과를 기대합니다.\n");
		Sleep(1000);
		srand(time(NULL));
		chance = (rand() % 50) + 1;
		if (status.STR > chance) //운동능력이 높을수록 입상할 확률 높음
		{
			printf("수뭉이가 전국 체전에서 입상했습니다!\n");
			printf("운동능력 +10\n"); //입상시 스텟업
			status.STR += 10;
		}
		else
		{
			printf("수뭉이가 아쉽게도 입상하지 못했습니다.\n");
		}
		break;
	case 3:
		printf("수뭉이가 그림 공모전에 나갔습니다. 좋은 결과를 기대합니다.\n");
		Sleep(1000);
		srand(time(NULL));
		chance = (rand() % 50) + 1;
		if (status.ART > chance) //예술성이 높을수록 입상할 확률 높음
		{
			printf("수뭉이가 공모전에서 입상했습니다!\n"); //입상시 스텟업
			printf("예술성 +10\n");
			status.ART += 10;
		}
		else
		{
			printf("수뭉이가 아쉽게도 입상하지 못했습니다.\n");
		}
		break;
	}
	Sleep(1000);
	system("cls");
}

void act() {
	if (status.STRESS >= 30)
	{
		tired();
	}
	printf("1. 도서관 가기\n");
	printf("2. 체육관 가기\n");
	printf("3. 그림 그리기\n");
	printf("4. 놀기\n");
	printf("무슨 행동을 할지 숫자로 적어주세요(1 ~ 4 이외의 숫자 입력 시 랜덤 선택) : ");
	scanf("%d", &choice);
	Sleep(500);
	if (choice > 4 || choice < 1) //지정된 숫자이외의 숫자 입력시 1~4부터 하나 무작위 선택
	{
		srand(time(NULL));
		choice = (rand() % 4) + 1;
	}

	if (status.STRESS >= 30) //스트레스 30이상시 30퍼센트 확률로 행동안함 (스텟변화 X)
	{
		srand(time(NULL));
		if ((rand() % 100) + 1 <= 30)
		{
			choice = -1;
		}
	}
	switch (choice) //입력받은 숫자에 따라 행동
	{
	case 1:
		printf("수뭉이가 공부를 하기 위해 도서관으로 갔습니다. 열심히 공부를 하고 온 것 같습니다.\n");
		printf("지능 +3   스트레스 +6\n");
		status.INT += 3;
		status.STRESS += 6;
		break;
	case 2:
		printf("수뭉이가 운동을 하기 위해 체육관으로 갔습니다. 열심히 운동을 하고 온 것 같습니다.\n");
		printf("운동 능력 +3   스트레스 +6\n");
		status.STR += 3;
		status.STRESS += 6;
		break;
	case 3:
		printf("수뭉이가 그림을 그리기 위해 미술학원으로 갔습니다. 열심히 그림을 그리고 온 것 같습니다.\n");
		printf("예술성 +3   스트레스 +6\n");
		status.ART += 3;
		status.STRESS += 6;
		break;
	case 4:
		printf("수뭉이가 친구들과 함께 놀러 나갔습니다. 재밌게 놀고 온 것 같습니다.\n");
		printf("스트레스 -15\n");
		status.STRESS -= 15;
		break;
	default:
		printf("수뭉이가 아무것도 하기 싫어합니다.\n");
	}
	Sleep(1000);
	if (status.STRESS <= 0)
	{
		status.STRESS = 0;
	}
}

void rou() // 뼈대 함수
{
	for (; day <= 15; day++) //day1부터 15까지 반복
	{
		system("cls");
		childSuMoong();
		printf("Day%d\n", day);
		printStatus(status);
		Sleep(1500);
		if (status.STRESS >= 50) //스트레스 50이상시 가출엔딩
		{
			runEnd();
			break;
		}

		if (day % 5 != 0) {
			act();
		}
		else if (day == 5 || day == 10) {
			printf("수뭉이가 오늘은 혼자서 공부를 하고 싶다고 합니다. 허락하겠습니까?\n");
			printf("1. 허락한다.\n");
			printf("2. 허락하지 않는다.\n");
			printf("무슨 행동을 할지 숫자로 적어주세요(1 ~ 2 이외의 숫자 입력 시 랜덤 선택) : ");
			scanf("%d", &choice);
			Sleep(1000);

			srand(time(NULL));
			if (choice != 1 && choice != 2) //1과 2이외의 숫자 입력시 1,2중 하나 랜덤 선택
			{
				choice = (rand() % 2) + 1;
			}
			if (choice == 1)
			{
				printf("수뭉이가 자유롭게 공부를 하고 돌아왔습니다.\n"); //모든 스텟이 0~6사이에서 증가
				status.INT += (rand() % 7);
				status.ART += (rand() % 7);
				status.STR += (rand() % 7);
				status.STRESS += 3;
				Sleep(1000);
			}
			else if (choice == 2) {
				printf("수뭉이가 슬퍼합니다.\n");
				printf("스트레스 +10\n");
				Sleep(1000);
				status.STRESS += 10;

				system("cls");
				childSuMoong();
				printf("Day%d\n", day);
				printStatus(status);
				act();
			}
		}
		else if (day == 15) {
			contest();
		}
	}
	return;
}

void end() //엔딩 함수
{
	printf("15일간의 여정이 끝났습니다.\n");
	printFinalStatus(status);
	Sleep(1000);

	if (status.INT >= 45) //INT 45이상시 학자 엔딩 
	{
		proEnd();
	}
	else if (status.ART >= 45) //ART 45이상시 화백 엔딩
	{
		artEnd();
	}
	else if (status.STR >= 45) //STR 45이상시 운동선수 엔딩
	{
		spoEnd();
	}
	else //아무것도 해당 안되면 취준생 엔딩
	{
		jobXEnd();
	}

	return;
}

int main() //메인함수
{
	printf("안녕하세요! 당신이 수뭉이를 키워주실 분이군요!\n");
	printf("당신은 오늘부터 15일동안 수뭉이를 키우게 되실거에요.\n");
	printf("열심히 키워주길 바랄게요!\n");
	Sleep(5000);
	rou();
	end();

	return 0;
}
